
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>日志记录的最佳实践 · 每周翻译计划</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="JalanJiang.江子抑 <jjy@meitu.com>">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-twilight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="the-downsides-of-json-for-config-files.html" />
    
    
    <link rel="prev" href="../language/simple-jwt-implementation-in-nodejs.html" />
    

    
        <link rel="shortcut icon" href='../favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"JalanJiang","repo":"weekly-translation","type":"star","size":"small"}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://jalan.space" target="_blank" class="custom-link">我的博客</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">编程语言</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../language/types-are-moving-to-the-right.html">
            
                <a href="../language/types-are-moving-to-the-right.html">
            
                    
                        <b>2.1.</b>
                    
                    类型声明右移的原因
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../language/simple-jwt-implementation-in-nodejs.html">
            
                <a href="../language/simple-jwt-implementation-in-nodejs.html">
            
                    
                        <b>2.2.</b>
                    
                    Node.js 的简单 JWT 实现
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">其他</li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="follow-these-logging-best-practices-to-get-the-most-out-of-application-level-logging-slides.html">
            
                <a href="follow-these-logging-best-practices-to-get-the-most-out-of-application-level-logging-slides.html">
            
                    
                        <b>3.1.</b>
                    
                    日志记录的最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="the-downsides-of-json-for-config-files.html">
            
                <a href="the-downsides-of-json-for-config-files.html">
            
                    
                        <b>3.2.</b>
                    
                    用 JSON 作为配置文件的缺陷
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >日志记录的最佳实践</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <ul>
<li>&#x539F;&#x6587;&#xFF1A;<a href="https://geshan.com.np/blog/2019/03/follow-these-logging-best-practices-to-get-the-most-out-of-application-level-logging-slides/" target="_blank">Logging best practices to get the most out of application level logging &#x2013; Slides</a></li>
<li>&#x4F5C;&#x8005;&#xFF1A;<a href="https://geshan.com.np/" target="_blank">Geshan</a></li>
<li>&#x7FFB;&#x8BD1;&#xFF1A;<a href="http://jalan.space" target="_blank">&#x6C5F;&#x4E94;&#x6E23;</a></li>
</ul>
<h1 id="&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;">&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</h1>
<p>&#x6765;&#x81EA;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x65E5;&#x5FD7;&#x662F;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x5BF9;&#x4F60;&#x552F;&#x4E00;&#x7684;&#x53CD;&#x9988;&#x3002;&#x8BA9;&#x65E5;&#x5FD7;&#x5408;&#x7406;&#x5316;&#x5E76;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x68C0;&#x7D22;&#x80FD;&#x529B;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x4E00;&#x4E2A;&#x9ED1;&#x6697;&#x7684;&#x623F;&#x95F4;&#x91CC;&#x70B9;&#x4EAE;&#x4E86;&#x4E00;&#x4E2A;&#x706B;&#x628A;&#x3002;</p>
<p>&#x5F53;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x65F6;&#xFF0C;&#x201C;&#x5145;&#x5206;&#x5229;&#x7528;&#x65E5;&#x5FD7;&#x201D;&#x8FD9;&#x4E00;&#x505A;&#x6CD5;&#x5E26;&#x6765;&#x7684;&#x6548;&#x679C;&#x5E38;&#x5E38;&#x88AB;&#x6211;&#x4EEC;&#x4F4E;&#x4F30;&#x3002;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x5229;&#x7528;&#x5E94;&#x7528;&#x5C42;&#x65E5;&#x5FD7;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x4E86;&#x89E3;&#x5E94;&#x7528;&#x6574;&#x4F53;&#x7684;&#x5065;&#x5EB7;&#x72B6;&#x51B5;&#x3002;</p>
<blockquote>
<p>&#x65E5;&#x5FD7;&#x8FD8;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5206;&#x6790;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
</blockquote>
<p>&#x591A;&#x5E74;&#x524D;&#x6211;&#x4E5F;&#x5199;&#x8FC7;&#x5982;&#x4F55;&#x6536;&#x96C6;&#x65E5;&#x5FD7;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x672C;&#x6587;&#x5C06;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x4ECE;&#x5E94;&#x7528;&#x7EA7;&#x522B;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x83B7;&#x53D6;&#x65E5;&#x5FD7;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#x6536;&#x96C6;&#x5E2E;&#x52A9;&#x4F60;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;</p>
<p><img src="https://geshan.com.np/images/logging-best-practices/logging-bp.jpg" alt=""></p>
<h2 id="&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;">&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</h2>
<p>&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#x662F;&#x6536;&#x96C6;&#x65E5;&#x5FD7;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#xFF1A;</p>
<h3 id="1-&#x5408;&#x7406;&#x5730;&#x8BB0;&#x5F55;&#x4FE1;&#x606F;">1. &#x5408;&#x7406;&#x5730;&#x8BB0;&#x5F55;&#x4FE1;&#x606F;</h3>
<p>&#x8FC7;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x4F1A;&#x5E72;&#x6270;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x542C;&#xFF0C;&#x800C;&#x4FE1;&#x606F;&#x592A;&#x5C11;&#x53C8;&#x4E0D;&#x8DB3;&#x4EE5;&#x6EE1;&#x8DB3;&#x6211;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x3002;&#x81F3;&#x4E8E;&#x8BB0;&#x5F55;&#x591A;&#x5C11;&#x7684;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x624D;&#x6700;&#x4E3A;&#x5408;&#x7406;&#xFF0C;&#x8FD9;&#x5F88;&#x96BE;&#x628A;&#x63E1;&#x5E73;&#x8861;&#xFF0C;&#x5BF9;&#x6211;&#x4EEC;&#x800C;&#x8A00;&#x8FD9;&#x4E5F;&#x662F;&#x4E2A;&#x6311;&#x6218;&#x3002;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x601D;&#x8003;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x8BF7;&#x6C42;&#x7684;&#x8FFD;&#x8E2A;&#xFF0C;&#x4F8B;&#x5982;&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7684;&#x8BF7;&#x6C42;&#x6807;&#x8BC6;&#x7B26;&#x6765;&#x6807;&#x8BB0;&#x8BF7;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#xFF1A;<strong>&#x65E5;&#x5FD7;&#x662F;&#x6682;&#x5B58;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x800C;&#x975E;&#x6C38;&#x4E45;&#x5B58;&#x5728;&#x7684;</strong>&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5F80;&#x5F80;&#x53EA;&#x5B58;&#x5728;&#x51E0;&#x5929;&#x5230;&#x51E0;&#x5468;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<h3 id="2-&#x59CB;&#x7EC8;&#x9075;&#x5FAA;&#x4E25;&#x683C;&#x7684;&#x65E5;&#x5FD7;&#x7EA7;&#x522B;">2. &#x59CB;&#x7EC8;&#x9075;&#x5FAA;&#x4E25;&#x683C;&#x7684;&#x65E5;&#x5FD7;&#x7EA7;&#x522B;</h3>
<p>&#x5982;&#x679C;&#x7EBF;&#x4E0A;&#x51FA;&#x73B0; emergency &#x7EA7;&#x522B;&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x7684;&#x5F85;&#x547D;&#x7535;&#x8BDD;&#x5C06;&#x5728;&#x51CC;&#x6668; 2 &#x70B9;&#x54CD;&#x8D77;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x7684;&#x4EC5;&#x4EC5;&#x662F; info &#x7EA7;&#x522B;&#x7684;&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x4E0D;&#x9700;&#x8981;&#x6253;&#x6270;&#x5230;&#x4EFB;&#x4F55;&#x4EBA;&#x3002;&#x4F60;&#x548C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x9700;&#x8981;&#x5236;&#x5B9A;&#x5E76;&#x540C;&#x610F;&#x4E00;&#x4E9B;&#x65E5;&#x5FD7;&#x8BBE;&#x5B9A;&#x6807;&#x51C6;&#xFF0C;&#x4F8B;&#x5982;&#x50CF; <a href="https://tools.ietf.org/html/rfc5424" target="_blank">syslog one</a> &#x90A3;&#x6837;&#x3002;</p>
<h3 id="3-&#x7ED3;&#x6784;&#x5316;">3. &#x7ED3;&#x6784;&#x5316;</h3>
<p>&#x5728;&#x4F60;&#x7684;&#x65E5;&#x5FD7;&#x884C;&#x4E2D;&#x56FA;&#x5B9A;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#xFF0C;&#x4F8B;&#x5982;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x548C;&#x4E00;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x6570;&#x7EC4;&#xFF0C;&#x6570;&#x7EC4;&#x7528;&#x6765;&#x6269;&#x5C55;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x6709;&#x5173;&#x4FE1;&#x606F;&#x3002;&#x9075;&#x5FAA;&#x5DF2;&#x7ECF;&#x7EA6;&#x5B9A;&#x597D;&#x7684; JSON &#x6807;&#x51C6;&#x683C;&#x5F0F;&#x6765;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#xFF0C;&#x56FA;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#x80FD;&#x8BA9;&#x89E3;&#x6790;&#x548C;&#x641C;&#x7D22;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#x3002;&#x4F60;&#x751A;&#x81F3;&#x80FD;&#x8BBE;&#x7F6E;&#x66F4;&#x591A;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x65E5;&#x671F;&#x662F;&#x9700;&#x8981;&#x5F3A;&#x5236;&#x8BB0;&#x5F55;&#x7684;&#xFF0C;&#x65E5;&#x5FD7;&#x63CF;&#x8FF0;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7; 255 &#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#x5219;&#x8BB0;&#x5F55;&#x5728;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x3002;&#x62E5;&#x6709;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x89C4;&#x5219;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x6613;&#x4E8E;&#x68C0;&#x7D22;&#x3002;&#x975E;&#x5E38;&#x63A8;&#x8350;&#x5728;&#x65E5;&#x5FD7;&#x884C;&#x4E2D;&#x8BB0;&#x5F55;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x5F53;&#x8BB0;&#x5F55;&#x8BA2;&#x5355;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x53D1;&#x8D27;&#x7684;&#x65E5;&#x5FD7;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x6DFB;&#x52A0;&#x8BA2;&#x5355;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x5230;&#x65E5;&#x5FD7;&#x4E2D;&#xFF08;&#x5F53;&#x7136;&#x662F;&#x6307;&#x8BA2;&#x5355;&#x4E2D;&#x4E0D;&#x654F;&#x611F;&#x7684;&#x4FE1;&#x606F;&#xFF09;&#x3002;</p>
<h3 id="4-&#x5C0F;&#x5FC3;&#x5730;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#xFF08;&#x4E0D;&#x8981;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#xFF09;">4. &#x5C0F;&#x5FC3;&#x5730;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#xFF08;&#x4E0D;&#x8981;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#xFF09;</h3>
<p>&#x786E;&#x4FDD;&#x6DFB;&#x52A0;&#x65E5;&#x5FD7;&#x540E;&#x4E0D;&#x4F1A;&#x8BA9;&#x7A0B;&#x5E8F;&#x7684;&#x8FD4;&#x56DE;&#x65F6;&#x95F4;&#x589E;&#x52A0;&#x8FC7;&#x591A;&#x7684;&#x6BEB;&#x79D2;&#x6570;&#x3002;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x7528;&#x5F02;&#x6B65;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#xFF0C;&#x65E5;&#x5FD7;&#x751A;&#x81F3;&#x80FD;&#x76F4;&#x63A5;&#x5199;&#x5165;&#x672C;&#x5730;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x6216;&#x4F7F;&#x7528;&#x65E5;&#x5FD7;&#x4F20;&#x8F93;&#x5DE5;&#x5177;&#x4F20;&#x8F93;&#x81F3;&#x4F60;&#x6240;&#x9009;&#x62E9;&#x7684;&#x65E5;&#x5FD7;&#x670D;&#x52A1;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x8BED;&#x8A00;/&#x6846;&#x67B6;&#x5F00;&#x53D1;&#x7684;&#x4E45;&#x7ECF;&#x8003;&#x9A8C;&#x7684;&#x5E93;&#x3002;&#x4F7F;&#x7528;&#x961F;&#x5217;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x4F46;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x5728;&#x67E5;&#x770B;&#x65E5;&#x5FD7;&#x65F6;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5EF6;&#x8FDF;&#x3002;</p>
<h3 id="5-&#x4F7F;&#x7528;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x5177;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;">5. &#x4F7F;&#x7528;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x5177;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;</h3>
<p>&#x4F60;&#x7528;&#x4E8E;&#x4F20;&#x8F93;&#x3001;&#x67E5;&#x770B;&#x3001;&#x641C;&#x7D22;&#x3001;&#x6574;&#x7406;&#x65E5;&#x5FD7;&#x7684;&#x5DE5;&#x5177;&#x6216;&#x670D;&#x52A1;&#x90FD;&#x662F;&#x4F60;&#x548C;&#x4F60;&#x56E2;&#x961F;&#x7684;&#x9009;&#x62E9;&#x3002;&#x8003;&#x8651;&#x5230;&#x9884;&#x7B97;&#x548C;&#x4F7F;&#x7528;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x56E2;&#x961F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x81EA;&#x6211;&#x7BA1;&#x7406;&#x7684;&#x5DE5;&#x5177;&#x6808;&#xFF0C;&#x4F8B;&#x5982; <a href="https://www.elastic.co/elk-stack" target="_blank">ELK</a>/<a href="https://www.graylog.org/" target="_blank">Gralog</a> &#x6216;&#x5145;&#x5206;&#x5229;&#x7528; SAAS &#x670D;&#x52A1;&#x4F8B;&#x5982; <a href="https://logentries.com/" target="_blank">Logentries</a>/<a href="https://sematext.com/logsene/" target="_blank">Sematext Logsense</a>&#x3002;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x80FD;&#x6709;&#x6548;&#x6EE1;&#x8DB3;&#x4F60;&#x9700;&#x6C42;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x961F;&#x5217;&#x5B9E;&#x65F6;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x5C31;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x9009;&#x62E9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BBE;&#x8BA1;&#x4F60;&#x7684;&#x65E5;&#x5FD7;&#x6536;&#x96C6;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x548C;&#x5DE5;&#x5177;&#x6808;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5145;&#x5206;&#x6EE1;&#x8DB3;&#x4F60;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<h2 id="ppt-&#x6587;&#x4EF6;">PPT &#x6587;&#x4EF6;</h2>
<p>&#x4E8C;&#x6708;&#x4EFD;&#x65F6;&#xFF0C;&#x6211;&#x5728;&#x516C;&#x53F8;&#x8FDB;&#x884C;&#x4E86;&#x6709;&#x5173;&#x201C;&#x65E5;&#x5FD7;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x201D;&#x7684;&#x6F14;&#x8BB2;&#xFF0C;&#x6F14;&#x8BB2;&#x65F6;&#x6240;&#x7528;&#x7684; PPT &#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728; <a href="https://www.slideshare.net/geshan/logging-best-practices" target="_blank">slideshare</a> &#x548C; <a href="https://speakerdeck.com/geshan/logging-best-practices" target="_blank">speaker deck</a> &#x67E5;&#x770B; PPT&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<blockquote>
<p>&#x5982;&#x679C;&#x8BF4;&#x72D7;&#x662F;&#x4EBA;&#x7C7B;&#x6700;&#x597D;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x90A3;&#x4E48;&#x65E5;&#x5FD7;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x6700;&#x597D;&#x7684;&#x670B;&#x53CB;&#x5566;&#x3002;</p>
</blockquote>
<p>&#x8BF7;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x5229;&#x7528;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x7262;&#x8BB0;&#x6B64;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3002;</p>
<h1 id="&#x751F;&#x8BCD;&#x548C;&#x77ED;&#x8BED;">&#x751F;&#x8BCD;&#x548C;&#x77ED;&#x8BED;</h1>
<ul>
<li>commendable&#xFF1A;&#x503C;&#x5F97;&#x8D5E;&#x626C;&#x7684;</li>
<li>torch&#xFF1A;&#x706B;&#x70AC;<ul>
<li>is like having a torch in a dark room</li>
</ul>
</li>
<li>exploit&#xFF1A;&#x5229;&#x7528;</li>
<li>underrate&#xFF1A;&#x8FC7;&#x4F4E;&#x8BC4;&#x4EF7;&#xFF0C;&#x4F4E;&#x4F30;</li>
<li>as well as&#xFF1A;&#x4EE5;&#x53CA;</li>
<li>utilize&#xFF1A;&#x5229;&#x7528;</li>
<li>profile application performance&#xFF1A;&#x63CF;&#x8FF0;/&#x5206;&#x6790;&#x5E94;&#x7528;&#x7684;&#x6027;&#x80FD;</li>
<li>some years back&#xFF1A;&#x591A;&#x5E74;&#x524D;</li>
<li>optimally&#xFF1A;&#x6700;&#x4F73;&#x7684;&#x3001;&#x7406;&#x60F3;&#x7684;&#x3001;&#x9002;&#x5B9C;&#x5730;</li>
<li>strike the balance&#xFF1A;&#x53D6;&#x5F97;&#x5E73;&#x8861;</li>
<li>in the case of&#xFF1A;&#x5C31;&#x2026;&#x2026;&#x800C;&#x8A00;&#xFF1B;&#x81F3;&#x4E8E;&#xFF1B;&#x5728;&#x2026;&#x2026;&#x60C5;&#x51B5;&#x4E0B;<ul>
<li>in case of&#xFF1A;&#x5982;&#x679C;&#xFF0C;&#x4E07;&#x4E00;</li>
<li><a href="http://www.ecp.com.cn/cc/g1/nwwd/20070812121733.htm" target="_blank">in case of &#x548C;in the case of &#x662F;&#x5426;&#x610F;&#x601D;&#x76F8;&#x540C;</a></li>
</ul>
</li>
<li>temporal&#xFF1A;&#x6682;&#x65F6;&#x7684;&#xFF1B;permanent&#xFF1A;&#x4E0D;&#x53D8;&#x7684;<ul>
<li>Another thing to keep in mind is logs are temporal, not permanent. </li>
</ul>
</li>
<li>mandatory&#xFF1A;&#x5F3A;&#x5236;&#x6027;&#x7684;</li>
<li>sensitive&#xFF1A;&#x654F;&#x611F;&#x7684;<ul>
<li>things that are not sensitive of course</li>
</ul>
</li>
<li>appetite&#xFF1A;&#x80C3;&#x53E3;&#xFF0C;&#x98DF;&#x6B32;</li>
<li>infrastructure&#xFF1A;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</li>
<li>As far as possible&#xFF1A;&#x5C3D;&#x91CF;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x7684;</li>
<li>tried and trusted&#xFF1A;&#x7ECF;&#x8003;&#x9A8C;&#x8BC1;&#x660E;&#x597D;&#x7684;&#xFF1B;&#x4E45;&#x7ECF;&#x8003;&#x9A8C;<ul>
<li>You can also make use of <strong>tried and trusted</strong> library depending on the language/framework you are working with.  </li>
</ul>
</li>
</ul>
<footer class="page-footer"><span class="copyright">JalanJiang.&#x6C5F;&#x5B50;&#x6291; all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2019-05-18 19:55:06
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../language/simple-jwt-implementation-in-nodejs.html" class="navigation navigation-prev " aria-label="Previous page: Node.js 的简单 JWT 实现">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="the-downsides-of-json-for-config-files.html" class="navigation navigation-next " aria-label="Next page: 用 JSON 作为配置文件的缺陷">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"日志记录的最佳实践","level":"3.1","depth":1,"next":{"title":"用 JSON 作为配置文件的缺陷","level":"3.2","depth":1,"path":"other/the-downsides-of-json-for-config-files.md","ref":"other/the-downsides-of-json-for-config-files.md","articles":[]},"previous":{"title":"Node.js 的简单 JWT 实现","level":"2.2","depth":1,"path":"language/simple-jwt-implementation-in-nodejs.md","ref":"language/simple-jwt-implementation-in-nodejs.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-default","disqus","prism","-highlight","tbfed-pagefooter","github-buttons","page-toc-button","back-to-top-button","sitemap-general","favicon@^0.0.2","splitter","baiduana"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"JalanJiang.江子抑","modify_label":"该文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prismjs/themes/prism-twilight.css"]},"disqus":{"useIdentifier":false,"shortName":"jalanspace"},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sitemap-general":{"prefix":"http://jalan.space/leetcode-notebook/"},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"theme":"sepia","family":"serif","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"buttons":[{"user":"JalanJiang","repo":"weekly-translation","type":"star","size":"small"}]},"baiduana":{},"baidu":{"token":"c47c7dbbbbb8b1bd7729048f358cd896"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}}},"theme":"default","author":"JalanJiang.江子抑 <jjy@meitu.com>","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"每周翻译计划","links":{"sidebar":{"我的博客":"http://jalan.space"},"sharing":{"google":null,"facebook":null,"twitter":null,"weibo":null,"all":null}},"gitbook":"*","description":"每周翻译一篇英文技术文章~","extension":""},"file":{"path":"other/follow-these-logging-best-practices-to-get-the-most-out-of-application-level-logging-slides.md","mtime":"2019-05-18T11:55:06.193Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-20T12:38:37.361Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baiduana/baidu_gitbook.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

