
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Serverless 和 PaaS 的区别 · 每周翻译计划</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="JalanJiang.江子抑 <jjy@meitu.com>">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-twilight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../language/types-are-moving-to-the-right.html" />
    
    
    <link rel="prev" href="../" />
    

    
        <link rel="shortcut icon" href='../favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"JalanJiang","repo":"weekly-translation","type":"star","size":"small"}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://jalan.space" target="_blank" class="custom-link">我的博客</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">架构</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="how-are-serverless-computing-and-platform-as-a-service-different.html">
            
                <a href="how-are-serverless-computing-and-platform-as-a-service-different.html">
            
                    
                        <b>2.1.</b>
                    
                    Serverless 和 PaaS 的区别
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">编程语言</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../language/types-are-moving-to-the-right.html">
            
                <a href="../language/types-are-moving-to-the-right.html">
            
                    
                        <b>3.1.</b>
                    
                    类型声明右移的原因
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../language/simple-jwt-implementation-in-nodejs.html">
            
                <a href="../language/simple-jwt-implementation-in-nodejs.html">
            
                    
                        <b>3.2.</b>
                    
                    Node.js 的简单 JWT 实现
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">其他</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../other/follow-these-logging-best-practices-to-get-the-most-out-of-application-level-logging-slides.html">
            
                <a href="../other/follow-these-logging-best-practices-to-get-the-most-out-of-application-level-logging-slides.html">
            
                    
                        <b>4.1.</b>
                    
                    日志记录的最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../other/the-downsides-of-json-for-config-files.html">
            
                <a href="../other/the-downsides-of-json-for-config-files.html">
            
                    
                        <b>4.2.</b>
                    
                    用 JSON 作为配置文件的缺陷
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Serverless 和 PaaS 的区别</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <ul>
<li>&#x539F;&#x6587;&#xFF1A;<a href="https://www.cloudflare.com/learning/serverless/glossary/serverless-vs-paas/" target="_blank">How are serverless computing and Platform-as-a-Service (PaaS) different?</a></li>
<li>&#x4F5C;&#x8005;&#xFF1A;<a href="https://www.cloudflare.com/" target="_blank">cloudflare</a></li>
<li>&#x7FFB;&#x8BD1;&#xFF1A;<a href="http://jalan.space" target="_blank">&#x6C5F;&#x4E94;&#x6E23;</a></li>
</ul>
<h1 id="serverless-&#x548C;-paas-&#x7684;&#x533A;&#x522B;">Serverless &#x548C; PaaS &#x7684;&#x533A;&#x522B;</h1>
<blockquote>
<p>&#x5C3D;&#x7BA1; PaaS &#x548C;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x8BA1;&#x7B97;&#x90FD;&#x4E0D;&#x6D89;&#x53CA;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x540E;&#x7AEF;&#x7BA1;&#x7406;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x51E0;&#x4E2A;&#x56E0;&#x7D20;&#x5C06;&#x8FD9;&#x4E24;&#x4E2A;&#x6A21;&#x578B;&#x533A;&#x5206;&#x5F00;&#x6765;&#xFF0C;&#x5305;&#x62EC;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3001;&#x5B9A;&#x4EF7;&#x548C;&#x5728;&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;&#x90E8;&#x7F72;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
</blockquote>
<p>&#x56E0;&#x4E3A;&#x5BF9;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8A00;&#xFF0C;<a href="https://www.cloudflare.com/learning/serverless/what-is-serverless/" target="_blank">&#x65E0;&#x670D;&#x52A1;&#x8BA1;&#x7B97;</a> &#x548C; <a href="https://www.cloudflare.com/learning/serverless/glossary/platform-as-a-service-paas/" target="_blank">&#x5E73;&#x53F0;&#x5373;&#x670D;&#x52A1;</a> &#x67B6;&#x6784;&#x5747;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x6709;&#x4E9B;&#x8BB8;&#x76F8;&#x4F3C;&#xFF0C;&#x7136;&#x800C;&#x8FD8;&#x662F;&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x5C06;&#x8FD9;&#x4E24;&#x79CD;&#x67B6;&#x6784;&#x533A;&#x522B;&#x5F00;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4EC5;&#x9002;&#x5408;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x67B6;&#x6784;&#x4E2D;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x4E24;&#x8005;&#x6700;&#x5927;&#x7684;&#x5DEE;&#x522B;&#x662F;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;&#x4EF7;&#x683C;&#x3001;&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x3001;&#x5DE5;&#x5177;&#x548C;&#x5728; <a href="https://www.cloudflare.com/learning/serverless/glossary/what-is-edge-computing/" target="_blank">&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;</a> &#x7684;&#x90E8;&#x7F72;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="https://www.cloudflare.com/img/learning/serverless/glossary/serverless-vs-paas/paas-serverless-comparison.svg" alt=""></p>
<h2 id="paas-&#x548C;-serverless-&#x54EA;&#x4E2A;&#x66F4;&#x65B9;&#x4FBF;&#x4F38;&#x7F29;&#xFF1F;">PaaS &#x548C; serverless &#x54EA;&#x4E2A;&#x66F4;&#x65B9;&#x4FBF;&#x4F38;&#x7F29;&#xFF1F;</h2>
<p>&#x65E0;&#x670D;&#x52A1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x3001;&#x81EA;&#x52A8;&#x5730;&#x968F;&#x9700;&#x5E94;&#x53D8;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x6765;&#x81EA;&#x5F00;&#x53D1;&#x8005;&#x6216;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x989D;&#x5916;&#x914D;&#x7F6E;&#x3002;&#x5B83;&#x4EEC;&#x80FD;&#x591F;&#x6309;&#x5B9A;&#x4E49;&#x6269;&#x5C55;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x867D;&#x7136;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5BF9; PaaS &#x6258;&#x7BA1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x6839;&#x636E;&#x7528;&#x6237;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x6216;&#x7F29;&#x5C0F;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x662F; PaaS &#x7684;&#x56FA;&#x6709;&#x7279;&#x6027;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x9884;&#x6D4B;&#x624D;&#x80FD;&#x5BF9;&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x7684;&#x6269;&#x5BB9;&#x3002;</p>
<p>&#x65E0;&#x670D;&#x52A1;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x88AB;&#x7C7B;&#x6BD4;&#x6210;&#x4ECE;&#x6C34;&#x9F99;&#x5934;&#x53D6;&#x6C34;&#xFF0C;&#x6C34;&#x4EE3;&#x8868;&#x7740;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x3002;&#x5728;&#x73B0;&#x4EE3;&#x5BB6;&#x5EAD;&#x4E2D;&#xFF0C;&#x6C34;&#x9F99;&#x5934;&#x53EF;&#x4EE5;&#x88AB;&#x968F;&#x65F6;&#x6253;&#x5F00;&#xFF0C;&#x5E76;&#x80FD;&#x4EA7;&#x751F;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x6C34;&#x3002;PaaS &#x5219;&#x66F4;&#x50CF;&#x662F;&#x996E;&#x6C34;&#x673A;&#x6216;&#x6C34;&#x74F6;&#x9012;&#x9001;&#x670D;&#x52A1;&#x3002;&#x5B83;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6240;&#x9700;&#x7684;&#x3001;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x996E;&#x7528;&#x6C34;&#xFF0C;&#x4F46;&#x5B83;&#x83B7;&#x53D6;&#x6C34;&#x7684;&#x65B9;&#x5F0F;&#x5E76;&#x4E0D;&#x50CF;&#x76F4;&#x63A5;&#x6253;&#x5F00;&#x6C34;&#x9F99;&#x5934;&#x4E00;&#x6837;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x5982;&#x679C;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x7528;&#x6C34;&#x9700;&#x6C42;&#x589E;&#x957F;&#x4E86;&#xFF0C;&#x4ED6;&#x5FC5;&#x987B;&#x8BA9;&#x4F9B;&#x5E94;&#x5546;&#x8FD0;&#x9001;&#x66F4;&#x591A;&#x7684;&#x6C34;&#x8D44;&#x6E90;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#x90FD;&#x6709;&#x4EBA;&#x5904;&#x7406;&#x201C;&#x540E;&#x7AEF;&#x201D; &#x2014;&#x2014; &#x6E05;&#x6D01;&#x6C34;&#x8D44;&#x6E90;&#xFF0C;&#x628A;&#x6C34;&#x8D44;&#x6E90;&#x5E26;&#x5230;&#x5927;&#x697C;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x3002;&#x4F46;&#x53EA;&#x6709;&#x6C34;&#x9F99;&#x5934;&#x80FD;&#x6309;&#x9700;&#x6C42;&#x3001;&#x6309;&#x65F6;&#x5730;&#x7CBE;&#x786E;&#x63A7;&#x5236;&#x6C34;&#x8D44;&#x6E90;&#x7684;&#x91CF;&#x7EA7;&#x3002;</p>
<p>serverless &#x67B6;&#x6784;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x5728;&#x8BF7;&#x6C42;&#x65F6;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x529F;&#x80FD;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#x6765;&#x5FEB;&#x901F;&#x6269;&#x5BB9;&#x3002;&#x5F53;&#x5B83;&#x4EEC;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8BE5;&#x529F;&#x80FD;&#x6216;&#x8BE5;&#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x80FD;&#x901A;&#x8FC7;&#x5173;&#x95ED;&#x529F;&#x80FD;&#x5FEB;&#x901F;&#x5730;&#x7F29;&#x5C0F;&#x89C4;&#x6A21;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;serverless Web &#x5E94;&#x7528;&#x5728;&#x6709;&#x9700;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x80FD;&#x4E0D;&#x65AD;&#x5730;&#x5FEB;&#x901F;&#x4F38;&#x7F29;&#xFF0C;&#x5E76;&#x5728;&#x51E0;&#x79D2;&#x6216;&#x51E0;&#x6BEB;&#x79D2;&#x5185;&#x518D;&#x6B21;&#x54CD;&#x5E94;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E76;&#x542F;&#x52A8;&#x3002;&#x57FA;&#x4E8E; PaaS &#x6784;&#x5EFA;&#x7684;&#x5E94;&#x7528;&#x5219;&#x65E0;&#x6CD5;&#x8FBE;&#x5230; serverless &#x5FEB;&#x901F;&#x4F38;&#x7F29;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<h2 id="paas-&#x548C;-serverless-&#x7684;&#x4EF7;&#x683C;&#x6709;&#x4F55;&#x533A;&#x522B;&#xFF1F;">PaaS &#x548C; serverless &#x7684;&#x4EF7;&#x683C;&#x6709;&#x4F55;&#x533A;&#x522B;&#xFF1F;</h2>
<p>&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x6765;&#x770B;&#x770B;&#x6C34;&#x7684;&#x6BD4;&#x55BB;&#xFF0C;&#x4ECE;&#x6C34;&#x9F99;&#x5934;&#x83B7;&#x53D6;&#x6C34;&#x8D44;&#x6E90;&#x7684;&#x7528;&#x6237;&#x7528;&#x591A;&#x5C11;&#x6C34;&#x5C31;&#x4ED8;&#x591A;&#x5C11;&#x94B1;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;serverless &#x8D26;&#x5355;&#x662F;&#x5341;&#x5206;&#x7CBE;&#x786E;&#x7684;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EA;&#x4E3A;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x90E8;&#x5206;&#x4ED8;&#x8D39;&#x3002;&#x4E00;&#x4E9B; serverless &#x7684;&#x4F9B;&#x5E94;&#x5546;&#x6309;&#x670D;&#x52A1;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x5411;&#x5F00;&#x53D1;&#x8005;&#x6536;&#x8D39;&#xFF0C;&#x7CBE;&#x786E;&#x5230;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E0B;&#x6BCF;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x51E0;&#x5206;&#x4E4B;&#x4E00;&#x79D2;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x4F9B;&#x5E94;&#x5546;&#x5219;&#x6309;&#x7167;&#x8BF7;&#x6C42;&#x7684;&#x6B21;&#x6570;&#x6536;&#x8D39;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x996E;&#x6C34;&#x673A;&#x548C;&#x74F6;&#x88C5;&#x6C34;&#x7684;&#x7528;&#x6237;&#x4E5F;&#x53EA;&#x9700;&#x652F;&#x4ED8;&#x4ED6;&#x4EEC;&#x7528;&#x6C34;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x662F;&#x6309;&#x74F6;&#x6570;&#x4ED8;&#x8D39;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6309;&#x7167;&#x6C34;&#x7684;&#x5428;&#x6570;&#x4ED8;&#x8D39;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x4E00;&#x4E9B; PaaS &#x7684;&#x4F9B;&#x5E94;&#x5546;&#x6309;&#x7167;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5BB9;&#x5411;&#x5F00;&#x53D1;&#x8005;&#x6536;&#x8D39;&#x3002;&#x7136;&#x800C;&#xFF0C;PaaS &#x7684;&#x8D26;&#x5355;&#x5E76;&#x4E0D;&#x50CF; serverless &#x90A3;&#x6837;&#x7CBE;&#x786E;&#x3002;&#x53E6;&#x4E00;&#x4E9B; PaaS &#x4F9B;&#x5E94;&#x5546;&#x5411;&#x5F00;&#x53D1;&#x8005;&#x6BCF;&#x6708;&#x6536;&#x53D6;&#x56FA;&#x5B9A;&#x8D39;&#x7528;&#x3002;&#x5F00;&#x53D1;&#x8005;&#x4E00;&#x822C;&#x53EF;&#x4EE5;&#x5B9A;&#x5236;&#x4ED6;&#x4EEC;&#x6240;&#x8981;&#x4ED8;&#x8D39;&#x670D;&#x52A1;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x662F;&#x4E8B;&#x5148;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x65E0;&#x6CD5;&#x5B9E;&#x65F6;&#x8FDB;&#x884C;&#x589E;&#x52A0;&#x6216;&#x51CF;&#x5C11;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5E76;&#x4E0D;&#x80FD;&#x8BF4;&#x660E; serverless &#x67B6;&#x6784;&#x66F4;&#x52A0;&#x5B9E;&#x60E0;&#x3002;&#x5982;&#x679C;&#x4E00;&#x76F4;&#x5F00;&#x7740;&#x6C34;&#x9F99;&#x5934;&#x4E5F;&#x9700;&#x8981;&#x627F;&#x62C5;&#x9AD8;&#x6602;&#x7684;&#x6C34;&#x8D39;&#xFF0C;&#x5177;&#x6709;&#x7A33;&#x5B9A;&#x3001;&#x5927;&#x6D41;&#x91CF;&#x7684; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528; serverless &#x8FD0;&#x884C;&#x4EF7;&#x683C;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5F97;&#x6602;&#x8D35;&#x3002;</p>
<h2 id="paas-&#x548C;-serverless-&#x7684;&#x542F;&#x7528;&#x65F6;&#x95F4;&#x6709;&#x4F55;&#x4E0D;&#x540C;&#xFF1F;">PaaS &#x548C; serverless &#x7684;&#x542F;&#x7528;&#x65F6;&#x95F4;&#x6709;&#x4F55;&#x4E0D;&#x540C;&#xFF1F;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#xFF0C;serverless &#x5E94;&#x7528;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x54CD;&#x5E94;&#x3002;PaaS &#x6784;&#x5EFA;&#x7684;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x542F;&#x52A8;&#x548C;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E0D;&#x50CF; serverless &#x5E94;&#x7528;&#x90A3;&#x6837;&#x8F7B;&#x91CF;&#x7EA7;&#xFF0C;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x957F;&#x7684;&#x4E8B;&#x4EF6;&#x6765;&#x542F;&#x52A8;&#x548C;&#x8FD0;&#x884C;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x4E0A;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;PaaS &#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x90FD;&#x9700;&#x8981;&#x5728;&#x5927;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x6216;&#x5168;&#x5929;&#x5019;&#x8FD0;&#x884C;&#x3002;</p>
<h2 id="paas-&#x548C;-serverless-&#x5206;&#x522B;&#x63D0;&#x4F9B;&#x600E;&#x6837;&#x7684;&#x5DE5;&#x5177;&#xFF1F;">PaaS &#x548C; serverless &#x5206;&#x522B;&#x63D0;&#x4F9B;&#x600E;&#x6837;&#x7684;&#x5DE5;&#x5177;&#xFF1F;</h2>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;PaaS &#x4F9B;&#x5E94;&#x5546;&#x4F1A;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x6784;&#x5EFA;&#x548C;&#x7BA1;&#x7406;&#x4ED6;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5305;&#x62EC;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x548C;&#x8C03;&#x8BD5;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x56E0;&#x4E3A; serverless &#x5E94;&#x7528;&#x90FD;&#x4E0D;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x865A;&#x62DF;&#x673A;&#x8FD8;&#x662F;&#x5176;&#x4ED6;&#x673A;&#x5668;&#xFF0C;serverlss &#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;serverless &#x4F9B;&#x5E94;&#x5546;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x73AF;&#x5883;&#x4F9B;&#x5F00;&#x53D1;&#x8005;&#x6784;&#x5EFA;&#x548C;&#x6D4B;&#x8BD5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<h2 id="serverless-&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;&#x5417;&#xFF1F;">serverless &#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;&#x5417;&#xFF1F;</h2>
<p>serverless &#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x5728;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x80FD;&#x8FD0;&#x884C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97; serverless &#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;&#x90E8;&#x7F72;&#xFF0C;&#x4ECE;&#x800C;&#x975E;&#x5E38;&#x9760;&#x8FD1;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#xFF0C;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x5EF6;&#x8FDF;&#x60C5;&#x51B5;&#x7684;&#x4EA7;&#x751F;&#x3002;Service workers &#x548C; <a href="https://www.cloudflare.com/products/cloudflare-workers/" target="_blank">Cloudflare Worders</a> &#x5C31;&#x662F; serverless &#x9760;&#x8FD1;&#x7528;&#x6237;&#x8FD0;&#x884C;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#xFF1A;<a href="https://www.cloudflare.com/learning/serverless/serverless-javascript/" target="_blank">Serverless JavaScript &#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;</a>&#xFF09;</p>
<h2 id="&#x4F7F;&#x7528;-paas-&#x6784;&#x5EFA;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;&#xFF1F;">&#x4F7F;&#x7528; PaaS &#x6784;&#x5EFA;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;&#xFF1F;</h2>
<p>&#x4ECE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;PaaS &#x4E2D;&#x6CA1;&#x6709;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5C31;&#x6258;&#x7BA1;&#x4EE3;&#x7801;&#x7684;&#x4F4D;&#x7F6E;&#x800C;&#x8A00;&#xFF0C;PaaS &#x4ECD;&#x7136;&#x4E0E;&#x65E0;&#x670D;&#x52A1;&#x8BA1;&#x7B97;&#x4E0D;&#x540C;&#x3002;PaaS &#x4F9B;&#x5E94;&#x5546;&#x8981;&#x4E48;&#x5229;&#x7528;&#x5176;&#x4ED6;&#x4F9B;&#x5E94;&#x5546;&#x7684; IaaS&#xFF08;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5373;&#x670D;&#x52A1;&#xFF09;&#x4EA7;&#x54C1;&#xFF0C;&#x8981;&#x4E48;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7269;&#x7406;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x6784;&#x5EFA;&#x5728;&#x4E91;&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4EC5;&#x5728;&#x67D0;&#x4E9B;&#x6307;&#x5B9A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x4ECE;&#x800C;&#x963B;&#x6B62;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x901A;&#x8FC7;&#x5728;&#x7F51;&#x7EDC;&#x8FB9;&#x7F18;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x6765;&#x4F18;&#x5316;&#x5176;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<h1 id="&#x751F;&#x8BCD;&#x53CA;&#x77ED;&#x8BED;">&#x751F;&#x8BCD;&#x53CA;&#x77ED;&#x8BED;</h1>
<ul>
<li>architectures</li>
</ul>
<blockquote>
<p>n. &#x67B6;&#x6784;</p>
</blockquote>
<ul>
<li>divergences</li>
</ul>
<blockquote>
<p>n. &#x5206;&#x6B67;</p>
</blockquote>
<ul>
<li>invisible</li>
</ul>
<blockquote>
<p>adj. &#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF1B;&#x65E0;&#x5F62;&#x7684;</p>
</blockquote>
<ul>
<li>either one or the other</li>
</ul>
<blockquote>
<p>&#x4E8C;&#x8005;&#x5FC5;&#x5C45;&#x5176;&#x4E00;&#xFF1B;&#x6216;&#x662F;</p>
</blockquote>
<ul>
<li>scalability</li>
</ul>
<blockquote>
<p>n. &#x53EF;&#x6269;&#x5C55;&#x6027;</p>
</blockquote>
<ul>
<li>vendor</li>
</ul>
<blockquote>
<p>n. &#x4F9B;&#x5E94;&#x5546;</p>
</blockquote>
<ul>
<li>instantly</li>
</ul>
<blockquote>
<p>adv. &#x7ACB;&#x523B;&#x7684;&#xFF1B;&#x9A6C;&#x4E0A;</p>
</blockquote>
<ul>
<li>scenario</li>
</ul>
<blockquote>
<p>n. &#x573A;&#x666F;</p>
</blockquote>
<ul>
<li>purifyi</li>
</ul>
<blockquote>
<p>v. &#x6E05;&#x6D01;</p>
</blockquote>
<ul>
<li>precisely</li>
</ul>
<blockquote>
<p>adv. &#x7CBE;&#x786E;&#x5730;&#xFF1B;&#x51C6;&#x786E;&#x5730;</p>
</blockquote>
<ul>
<li>a flat monthly fee</li>
</ul>
<blockquote>
<p>&#x6BCF;&#x6708;&#x56FA;&#x5B9A;&#x8D39;&#x7528;</p>
</blockquote>
<ul>
<li>affordable</li>
</ul>
<blockquote>
<p>adj. &#x8D1F;&#x62C5;&#x5F97;&#x8D77;</p>
</blockquote>
<ul>
<li>prohibitively&#xFF1A;prohibitively expensive</li>
</ul>
<blockquote>
<p>adv. &#x8FC7;&#x9AD8;&#x5730;&#xFF1B;&#x8FC7;&#x5206;&#x5730;&#xFF1B;&#x7981;&#x6B62;&#x5730; </p>
</blockquote>
<footer class="page-footer"><span class="copyright">JalanJiang.&#x6C5F;&#x5B50;&#x6291; all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2019-05-26 21:30:38
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../language/types-are-moving-to-the-right.html" class="navigation navigation-next " aria-label="Next page: 类型声明右移的原因">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Serverless 和 PaaS 的区别","level":"2.1","depth":1,"next":{"title":"类型声明右移的原因","level":"3.1","depth":1,"path":"language/types-are-moving-to-the-right.md","ref":"language/types-are-moving-to-the-right.md","articles":[]},"previous":{"title":"简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-default","disqus","prism","-highlight","tbfed-pagefooter","github-buttons","page-toc-button","back-to-top-button","sitemap-general","favicon@^0.0.2","splitter","baiduana"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"JalanJiang.江子抑","modify_label":"该文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prismjs/themes/prism-twilight.css"]},"disqus":{"useIdentifier":false,"shortName":"jalanspace"},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sitemap-general":{"prefix":"http://jalan.space/leetcode-notebook/"},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"theme":"sepia","family":"serif","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"github-buttons":{"buttons":[{"user":"JalanJiang","repo":"weekly-translation","type":"star","size":"small"}]},"baiduana":{},"baidu":{"token":"c47c7dbbbbb8b1bd7729048f358cd896"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}}},"theme":"default","author":"JalanJiang.江子抑 <jjy@meitu.com>","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"每周翻译计划","links":{"sidebar":{"我的博客":"http://jalan.space"},"sharing":{"google":null,"facebook":null,"twitter":null,"weibo":null,"all":null}},"gitbook":"*","description":"每周翻译一篇英文技术文章~","extension":""},"file":{"path":"architecture/how-are-serverless-computing-and-platform-as-a-service-different.md","mtime":"2019-05-26T13:30:38.025Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-26T13:32:18.719Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baiduana/baidu_gitbook.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

